# LineArcTangentFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeometryFailures..::..LineArcTangentFailure Property
BuiltInFailures..::..GeometryFailures Class See Also
---
Can't keep arc element and straight line element tangent.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LineArcTangentFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LineArcTangentFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LineArcTangentFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeometryFailures Class
Autodesk.Revit.DB Namespace